Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAA169.atdf
      <value-group caption="Secondary Oscillator Kick Start Programmability bit" name="DEVCFG0__SOSCBOOST">
         <value caption="Boost the kick start of the oscillator" name="ON" value="0x1" />
         <value caption="Normal start of the oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Primary Crystal Oscillator Course Gain Control bits" name="DEVCFG0__POSCGAIN">
         <value caption="2x gain setting" name="GAIN_2X" value="0x3" />
         <value caption="1.5x gain setting" name="GAIN_1_5X" value="0x2" />
         <value caption="0.5x gain setting" name="GAIN_0_5X" value="0x0" />
         <value caption="1x gain setting" name="GAIN_1X" value="0x1" />
         <value caption="Gain level 3 (Highest)" name="GAIN_LEVEL_3" value="0x3" />
         <value caption="Gain level 2" name="GAIN_LEVEL_2" value="0x2" />
         <value caption="Gain level 1" name="GAIN_LEVEL_1" value="0x1" />
         <value caption="Gain level 0 (Lowest)" name="GAIN_LEVEL_0" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Boost bit" name="DEVCFG0__POSCBOOST">
         <value caption="Boost the kick start of the oscillator" name="ON" value="0x1" />
         <value caption="Normal start of the oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Primary Crystal Oscillator Fine Gain Control bits" name="DEVCFG0__POSCFGAIN">
         <value caption="Gain is G3" name="GAIN_G3" value="0x3" />
         <value caption="Gain is G2" name="GAIN_G2" value="0x2" />
         <value caption="Gain is G1" name="GAIN_G1" value="0x1" />
         <value caption="Gain is G0" name="GAIN_G0" value="0x0" />
      </value-group>
      <value-group caption="" name="DEVCFG0__POSCTYPE">
         <value caption="12 MHz Crystal used as Primary Oscillator" name="CRYSTAL_12MHZ" value="0x30000" />
         <value caption="24 MHz Crystal used as Primary Oscillator" name="CRYSTAL_24MHZ" value="0x20000" />
         <value caption="Resonator used as Primary Oscillator" name="RESONATOR" value="0x10000" />
         <value caption="8 MHz Crystal used as Primary Oscillator" name="CRYSTAL_8MHZ" value="0x0" />
      </value-group>
      <value-group caption="" name="DEVCFG0__POSCAGCRNG">
         <value caption="Range 1x" name="RANGE_1X" value="0x10000" />
         <value caption="Range 5x" name="RANGE_5X" value="0x0" />
      </value-group>
      <value-group caption="Primary Oscillator Automatic Gain Control bit" name="DEVCFG0__POSCAGC">
         <value caption="POSC Auto Gain Control Enabled" name="ON" value="0x1" />
         <value caption="POSC Auto Gain Control Disabled/Manual Gain Control Enabled" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="EJTAG Boot Enable bit" name="DEVCFG0__EJTAGBEN">
         <value caption="Reduced EJTAG functionality" name="REDUCED" value="0x0" />
         <value caption="Normal EJTAG functionality" name="NORMAL" value="0x1" />
      </value-group>
      <value-group caption="Primary Crystal AGC Gain Search Step Settling Time Control bits" name="DEVCFG0__POSCAGCDLY">
         <value caption="25 ms times POSCAGCRNG x" name="POSCAGCDLY1" value="0x3" />
         <value caption="6.25 ms times POSCAGCRNG x" name="POSCAGCDLY2" value="0x2" />
         <value caption="400 ms times POSCAGCRNG x" name="POSCAGCDLY3" value="0x1" />
         <value caption="100 ms times POSCAGCRNG x" name="POSCAGCDLY4" value="0x0" />
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCP0__CP">
         <value caption="Protection Enabled" name="ON" value="0x0" />
         <value caption="Protection Disabled" name="OFF" value="0x10000000" />
      </value-group>
      <value-group caption="Boot Flash True Sequence Number bits" name="" />
      <value-group caption="Boot Flash Complement Sequence Number bits" name="" />
   </module>

   <module caption="" id="02508" name="ADCHS" version="1">
      <register-group name="ADCHS">
         <register caption="ADC Control Register 1" name="ADCCON1" initval="0x00601000" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000007" name="DMABL" />
            <bitfield caption="Scan Trigger High Level/Positive Edge Sensitivity bit" mask="0x00000008" name="STRGLVL" values="ADCCON1__STRGLVL" />
            <bitfield caption="Interrupt Vector Shift bits" mask="0x00000070" name="IRQVS" values="ADCCON1__IRQVS" />
            <bitfield caption="Fast Synchronous Peripheral Clock to ADC Control Clock bit" mask="0x00000200" name="FSPBCLKEN" values="ADCCON1__FSPBCLKEN" />
            <bitfield caption="Fast Synchronous System Clock to ADC Control Clock bit" mask="0x00000400" name="FSSCLKEN" values="ADCCON1__FSSCLKEN" />
            <bitfield caption="Capacitive Voltage Division Enable bit" mask="0x00000800" name="CVDEN" values="ADCCON1__CVDEN" />
            <bitfield caption="Analog Input Charge Pump Enable bit - see datasheet" mask="0x00001000" name="AICPMPEN" values="ADCCON1__AICPMPEN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ADCCON1__SIDL" />
            <bitfield caption="ADC Module Enable bit" mask="0x00008000" name="ON" values="ADCCON1__ON" />
            <bitfield caption="Scan Trigger Source Select bits" mask="0x001F0000" name="STRGSRC" values="ADCCON1__STRGSRC" />
            <bitfield caption="Shared ADC Resolution bits" mask="0x00600000" name="SELRES" values="ADCCON1__SELRES" />
            <bitfield caption="Fractional Data Output Format bit" mask="0x00800000" name="FRACT" values="ADCCON1__FRACT" />
            <bitfield caption="Turbo Slave ADCx bits" mask="0x07000000" name="TRBSLV" values="ADCCON1__TRBSLV" />
            <bitfield caption="Turbo Master ADCx bits" mask="0x38000000" name="TRBMST" values="ADCCON1__TRBMST" />
            <bitfield caption="Turbo Channel Error Status bit" mask="0x40000000" name="TRBERR" values="ADCCON1__TRBERR" />
            <bitfield caption="Turbo Channel Enable bit" mask="0x80000000" name="TRBEN" values="ADCCON1__TRBEN" />
         </register>
