Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAA169.atdf
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD" />
            <bitfield mask="0x00000002" name="T2MD" />
            <bitfield mask="0x00000004" name="T3MD" />
            <bitfield mask="0x00000008" name="T4MD" />
            <bitfield mask="0x00000010" name="T5MD" />
            <bitfield mask="0x00000020" name="T6MD" />
            <bitfield mask="0x00000040" name="T7MD" />
            <bitfield mask="0x00000080" name="T8MD" />
            <bitfield mask="0x00000100" name="T9MD" />
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD" />
            <bitfield mask="0x00000002" name="U2MD" />
            <bitfield mask="0x00000004" name="U3MD" />
            <bitfield mask="0x00000008" name="U4MD" />
            <bitfield mask="0x00000010" name="U5MD" />
            <bitfield mask="0x00000020" name="U6MD" />
            <bitfield mask="0x00000100" name="SPI1MD" />
            <bitfield mask="0x00000200" name="SPI2MD" />
            <bitfield mask="0x00000400" name="SPI3MD" />
            <bitfield mask="0x00000800" name="SPI4MD" />
            <bitfield mask="0x00001000" name="SPI5MD" />
            <bitfield mask="0x00002000" name="SPI6MD" />
            <bitfield mask="0x00010000" name="I2C1MD" />
            <bitfield mask="0x00020000" name="I2C2MD" />
            <bitfield mask="0x00040000" name="I2C3MD" />
            <bitfield mask="0x00080000" name="I2C4MD" />
            <bitfield mask="0x00100000" name="I2C5MD" />
            <bitfield mask="0x01000000" name="USBMD" />
            <bitfield mask="0x10000000" name="CAN1MD" />
            <bitfield mask="0x20000000" name="CAN2MD" />
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000100" name="REFO1MD" />
            <bitfield mask="0x00000200" name="REFO2MD" />
            <bitfield mask="0x00000400" name="REFO3MD" />
            <bitfield mask="0x00000800" name="REFO4MD" />
            <bitfield mask="0x00001000" name="REFO5MD" />
            <bitfield mask="0x00010000" name="PMPMD" />
            <bitfield mask="0x00020000" name="EBIMD" />
            <bitfield mask="0x00040000" name="GPUMD" />
            <bitfield mask="0x00100000" name="GLCDMD" />
            <bitfield mask="0x00200000" name="SDHCMD" />
            <bitfield mask="0x00800000" name="SQI1MD" />
            <bitfield mask="0x10000000" name="ETHMD" />
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD" />
            <bitfield mask="0x00100000" name="RNGMD" />
            <bitfield mask="0x00400000" name="CRYPTMD" />
            <bitfield mask="0x10000000" name="DDR2CMD" />
         </register>
         <register caption="External Bus Interface Address Pin Configuration Register" name="CFGEBIA" offset="0xc0" rw="RW" size="4">
            <bitfield caption="EBI Address Pin Enable bit 0" mask="0x00000001" name="EBIA0EN" values="CFGEBIA__EBIA0EN" />
            <bitfield caption="EBI Address Pin Enable bit 1" mask="0x00000002" name="EBIA1EN" values="CFGEBIA__EBIA1EN" />
            <bitfield caption="EBI Address Pin Enable bit 2" mask="0x00000004" name="EBIA2EN" values="CFGEBIA__EBIA2EN" />
            <bitfield caption="EBI Address Pin Enable bit 3" mask="0x00000008" name="EBIA3EN" values="CFGEBIA__EBIA3EN" />
            <bitfield caption="EBI Address Pin Enable bit 4" mask="0x00000010" name="EBIA4EN" values="CFGEBIA__EBIA4EN" />
            <bitfield caption="EBI Address Pin Enable bit 5" mask="0x00000020" name="EBIA5EN" values="CFGEBIA__EBIA5EN" />
            <bitfield caption="EBI Address Pin Enable bit 6" mask="0x00000040" name="EBIA6EN" values="CFGEBIA__EBIA6EN" />
            <bitfield caption="EBI Address Pin Enable bit 7" mask="0x00000080" name="EBIA7EN" values="CFGEBIA__EBIA7EN" />
            <bitfield caption="EBI Address Pin Enable bit 8" mask="0x00000100" name="EBIA8EN" values="CFGEBIA__EBIA8EN" />
            <bitfield caption="EBI Address Pin Enable bit 9" mask="0x00000200" name="EBIA9EN" values="CFGEBIA__EBIA9EN" />
            <bitfield caption="EBI Address Pin Enable bit 10" mask="0x00000400" name="EBIA10EN" values="CFGEBIA__EBIA10EN" />
            <bitfield caption="EBI Address Pin Enable bit 11" mask="0x00000800" name="EBIA11EN" values="CFGEBIA__EBIA11EN" />
            <bitfield caption="EBI Address Pin Enable bit 12" mask="0x00001000" name="EBIA12EN" values="CFGEBIA__EBIA12EN" />
            <bitfield caption="EBI Address Pin Enable bit 13" mask="0x00002000" name="EBIA13EN" values="CFGEBIA__EBIA13EN" />
            <bitfield caption="EBI Address Pin Enable bit 14" mask="0x00004000" name="EBIA14EN" values="CFGEBIA__EBIA14EN" />
            <bitfield caption="EBI Address Pin Enable bit 15" mask="0x00008000" name="EBIA15EN" values="CFGEBIA__EBIA15EN" />
            <bitfield caption="EBI Address Pin Enable bit 16" mask="0x00010000" name="EBIA16EN" values="CFGEBIA__EBIA16EN" />
            <bitfield caption="EBI Address Pin Enable bit 17" mask="0x00020000" name="EBIA17EN" values="CFGEBIA__EBIA17EN" />
            <bitfield caption="EBI Address Pin Enable bit 18" mask="0x00040000" name="EBIA18EN" values="CFGEBIA__EBIA18EN" />
            <bitfield caption="EBI Address Pin Enable bit 19" mask="0x00080000" name="EBIA19EN" values="CFGEBIA__EBIA19EN" />
            <bitfield caption="EBI Address Pin Enable bit 20" mask="0x00100000" name="EBIA20EN" values="CFGEBIA__EBIA20EN" />
            <bitfield caption="EBI Address Pin Enable bit 21" mask="0x00200000" name="EBIA21EN" values="CFGEBIA__EBIA21EN" />
            <bitfield caption="EBI Address Pin Enable bit 22" mask="0x00400000" name="EBIA22EN" values="CFGEBIA__EBIA22EN" />
            <bitfield caption="EBI Address Pin Enable bit 23" mask="0x00800000" name="EBIA23EN" values="CFGEBIA__EBIA23EN" />
         </register>
