Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAA169.atdf
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
         <value caption="ARPT and ALRMEN may change as a result of a half second rollover during a read. The ARPT must be read repeatedly until the same value is read twice. This must be done since multiple bits may be changing." name="" value="0x1" />
         <value caption="ARPT and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 real-time clocks away from a half-second rollover" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
         <value caption="low initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x0" />
         <value caption="high initial value of the Alarm Pulse (When ALRMEN = 0)" name="" value="0x1" />
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
         <value caption="Chime is enabled ARPT is allowed to rollover from 0x00 to 0xFF" name="" value="0x1" />
         <value caption="Chime is disabled ARPT stops once it reaches 0x00" name="" value="0x0" />
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
         <value caption="Alarm is enabled" name="" value="0x1" />
         <value caption="Alarm is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00136" name="SB" version="1">
      <register-group name="SB">
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT0ELOG1" offset="0x0" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT0ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT0ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT0ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT0ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT0ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT1ELOG1" offset="0x400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT1ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT1ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT1ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT1ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT1ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT2ELOG1" offset="0x800" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT2ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT2ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT2ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT2ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT2ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT3ELOG1" offset="0xc00" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT3ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT3ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT3ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT3ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT3ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT4ELOG1" offset="0x1000" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT4ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT4ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT4ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT4ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT4ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT5ELOG1" offset="0x1400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT5ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT5ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT5ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT5ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT5ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT6ELOG1" offset="0x1800" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT6ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT6ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT6ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT6ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT6ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT7ELOG1" offset="0x10400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT7ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT7ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT7ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT7ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT7ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT8ELOG1" offset="0x10800" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT8ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT8ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT8ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT8ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT8ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT9ELOG1" offset="0x10c00" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT9ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT9ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT9ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT9ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT9ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT10ELOG1" offset="0x11000" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT10ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT10ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT10ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT10ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT10ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT11ELOG1" offset="0x11400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT11ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT11ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT11ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT11ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT11ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT12ELOG1" offset="0x11800" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT12ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT12ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT12ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT12ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT12ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT13ELOG1" offset="0x20400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT13ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT13ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT13ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT13ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT13ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT14ELOG1" offset="0x20800" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT14ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT14ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT14ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT14ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT14ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT15ELOG1" offset="0x20c00" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT15ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT15ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT15ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT15ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT15ELOG1__MULTI" />
         </register>
